Revit 2026 API

# CurveExtents Properties

---

The CurveExtents type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EndParameter | The end parameter of the curve extents. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | StartParameter | The start parameter of the curve extents. |

#### Reference

CurveExtents Class

Autodesk.Revit.DB Namespace